<template>
  <div class="faq">
    <MainMenu></MainMenu>


    <div class="inside_page">
		<div class="container">
			<div class="row">
				<div class="col-md-12">
					<div class="top_part">
						<h1>Вопросы-ответы</h1>
						<BreadCrumbs></BreadCrumbs>
					</div>
				</div>
			</div>

			<div class="row">
				<div class="col-12" id="accordion">
                    <b-card no-body
                        itemprop="mainEntity"
                        itemscope=""
                        itemtype="https://schema.org/Question"
                        class="faq-content--item"
                        v-for="(faq, index) in faqs"
                        :key="index"
                    >
                        <b-card-header
                            header-tag="div"
                            class="header"
                            role="tab"
                        >
                            <b-button
                                block
                                v-b-toggle="'accordion-' + index"
                                variant="none"
                                tag="h3"
                                itemprop="name"
                            >
                            {{ faq.title }}
                            </b-button>
                        </b-card-header>
                        <b-collapse :id="'accordion-'+index" accordion="my-accordion" role="tabpanel">
                            <b-card-body>
                                <b-card-text 
                                    v-html=faq.text
                                    itemprop="acceptedAnswer"
                                    itemscope=""
                                    itemtype="https://schema.org/Answer"
                                >
                                </b-card-text>
                            </b-card-body>
                        </b-collapse>
                    </b-card>
				</div>
			</div>
		</div>
	</div>

    <FreeConsultation class="inside_block"></FreeConsultation>
    <FooterMain></FooterMain>
  </div>
</template>


<script>
import MainMenu from '../components/MainMenu'
import BreadCrumbs from '../components/BreadCrumbs.vue'
import FreeConsultation from '../components/FreeConsultation.vue'
import FooterMain from '../components/footers/FooterMain.vue'
export default {
    data() {
        return{
            faqs: [
                {
                    title: "Какие курсы, квалификации и программы обучения вы предлагаете?",
                    text: "Мы предлагаем широкий диапазон обучений с различной квалификацией и глубиной знаний в области: охраны труда (безопасность труда и здоровья), пожарной безопасности, экологии (охраны окружающей среды) и устойчивого развития, первой доврачебной помощи, навыков личной эффективности, а также детской безопасности.<br>Посмотреть полный ассортимент наших обучений <a href='#'>link</a>",
                },
                {
                    title: "Вы разрабатываете индивидуальные курсы?",
                    text: "Да, мы разрабатываем индивидуальные курсы, отвечающие конкретным потребностям наших клиентов. <br> Свяжитесь с нами, чтобы обсудить Ваши требования <a href='#'>link</a>"
                },
                {
                    title: "Где проходят очные занятия?",
                    text: "Мы проводим очные занятия в Киеве в нашем учебном центре. Так же мы можем провести обучение на вашем предприятии. Более детально о всех доступных форматах обучения, узнайте <a href='#'>здесь</a>"
                },
                {
                    title: "Проводится ли обучение дистанционно?",
                    text: "Да, мы проводим обучение в дистанционном и смешанном формате. <br> Все виды дистанционного обучения, а также полный перечень доступных программ <a href='#'>здесь</a>"
                },
                {
                    title: "Предлагаете ли вы электронное обучение?",
                    text: "Да - мы предлагаем ряд курсов в виде электронного обучения, с помощью нашей цифровой платформы. А также варианты смешанного обучения в дистанционном формате и электронного. <br> Просмотреть полный ассортимент онлайн-продуктов можно <a href='#'>здесь</a>"
                },
                {
                    title: "Я только начинаю заниматься вопросами охраны труда. Что посоветуете?",
                    text: "Курс «Наименование» - это отправная точка для успешной карьеры в сфере безопасности труда и здоровья <br> Мы будем рады проконсультировать Вас более детально обо всех подходящих продуктах. Свяжитесь с <a href='#'>нами</a>"
                },
                {
                    title: "Мне нужен курс для моего директора. Что посоветуете?",
                    text: "Мы предлагаем очень популярный курс «Наименование» для директоров и топ-менеджеров. Этот курс доступен в электронном формате обучения или в форме очного обучения в нашем предприятии и в других местах по всей стране. <br>Посмотреть полный ассортимент наших обучений для <a href='#'>высшего руководства</a>"
                },
                {
                    title: "Мне нужен курс для моих работников, но я хочу, чтобы он отвечал их конкретным потребностям. Вы можете помочь?",
                    text: "Да - наши краткосрочные курсы помогут вам сделать это быстро и экономично. <br> Если вам нужен курс, специфичный для вашей рабочей среды или ориентированный на определенные типы рисков, мы можем создать курс, который подойдет для вашего бизнеса. <a href='#'>Свяжитесь с нами </a>"
                },
                {
                    title: "Какие консультационные услуги вы предлагаете?",
                    text: "Наши консультационные услуги полностью основаны на потребностях клиентов и включают в себя экспертизу, помогающую улучшить производительность в целом или в более конкретных областях (например, оценка рисков, анализ потребностей в обучении, специфические обследования, стратегическое планирование, оценка уровня зрелости системы управления охраной труда и культуры безопасности и т. д.)<br>Узнайте больше о <a href='#'>наших услугах </a>"
                },
                {
                    title: "Какие аудиты предлагает Международный центр безопасности труда и здоровья?",
                    text: "В настоящее время мы предлагаем ряд продуктов и услуг в области аудита, в том числе специальную услугу по комплексному анализу системы управления охраны труда или отдельных её элементов, которая дает базовое представление о том, насколько эффективна ваша система безопасности внедрена в компании в целом или на некоторых объектах, подразделениях."
                }
            ]
        }
    },

    components: {
        MainMenu,
        BreadCrumbs,
        FooterMain,
        FreeConsultation
    }
}
</script>

<style lang="scss">
.faq-content--item{
    .header{
        padding: 0;
        h3{
            width: 100%;
            text-align: left;
            padding: 0;
            outline: none;
            box-shadow: none;
            padding: 0 30px;
        }
        h3[aria-expanded="true"]{
            background: #eaf6ff;
            border-radius: 6px 6px 0 0;
            border-bottom: 1px solid #eee8e8;
            &::after{
                display: none;
            }
        }
    }
    .card-body{
        box-shadow: 0 4px 20px rgba(206, 206, 206, .25);
    }
}
.card{
    border: none;
}
</style>
